tap "nikitabobko/tap"
# Next-generation aircrack with lots of new features
brew "aircrack-ng"
# ARP scanning and fingerprinting tool
brew "arp-scan"
# Generate compilation database for clang tooling
brew "bear"
# Swiss army knife for network attacks and monitoring
brew "bettercap"
# Version manager for neovim
brew "bob"
# Formatting tools for C, C++, Obj-C, Java, JavaScript, TypeScript
brew "clang-format"
# Cross-platform make
brew "cmake"
# Pack, ship and run any application as a lightweight container
brew "docker"
# Multipurpose sniffer/interceptor/logger for switched LAN
brew "ettercap"
# Modern, maintained replacement for ls
brew "eza"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Command-line fuzzy finder written in Go
brew "fzf"
# GNU compiler collection
brew "gcc"
# Glorious Glasgow Haskell Compilation System
brew "ghc"
# Language Server for the Lua language
brew "lua-language-server"
# Package manager for the Lua programming language
brew "luarocks"
# Open source relational database management system
brew "mysql", restart_service: :changed
# NCurses Disk Usage
brew "ncdu"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Port scanning utility for large networks
brew "nmap"
# High performance message passing library
brew "open-mpi"
# General-purpose scripting language
brew "php"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Create beautiful image of your source code
brew "silicon"
# Tool Command Language
brew "tcl-tk"
# Simplified and community-driven man pages
brew "tldr"
# Terminal multiplexer
brew "tmux"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Internet file retriever
brew "wget"
# Shell extension to navigate your filesystem faster
brew "zoxide"
# AeroSpace is an i3-like tiling window manager for macOS
cask "aerospace"
cask "font-jetbrains-mono-nerd-font"
